# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
#####----- ORIGINAL -----#####
#depth_multiple: 0.33 # model depth multiple
#width_multiple: 0.50 # layer channel multiple
anchors:
#dd
  - [12, 16, 19, 36, 40, 28]  # P3/8
  - [36, 75, 76, 55, 72, 146]  # P4/16
  - [142, 110, 192, 243, 459, 401]  # P5/32
# #rgbt22, rgbt23
#  - [24.44, 47.73, 32.75, 68.84, 41.02, 93.37]    # P3/8
#  - [112.88, 51.32, 50.76, 121.89, 67.74, 167.52]   # P4/16
#  - [208.48, 54.59, 386.22, 49.77, 86.50, 230.83]  # P5/32
# #rgbt21
#  - [15, 20, 25, 35, 30, 45]    # P3/8
#  - [50, 90, 80, 60, 70, 140]   # P4/16
#  - [120, 150, 180, 220, 300, 250]  # P5/32
# #rgbt19
#  - [20, 30]   # P3/8
#  - [60, 120]  # P4/16
#  - [150, 200] # P5/32
# #rgbt10
#  - [20, 30, 28, 50, 35, 65]  # P3/8
#  - [50, 80, 70, 110, 90, 130]  # P4/16
#  - [110, 150, 140, 220, 180, 280]  # P5/32
# #rgbt9 - BAD
#  - [18, 25, 30, 40, 45, 60]  # P3/8
#  - [55, 75, 70, 100, 85, 120]  # P4/16
#  - [100, 140, 140, 200, 180, 260]  # P5/32
# #rgbt8
#  - [23, 44, 25, 56, 32, 70]  # P3/8
#  - [50, 90, 60, 110, 75, 130]  # P4/16
#  - [100, 180, 130, 230, 160, 290]  # P5/32
# #rgbt7
#  - [14, 18, 20, 34, 36, 30] # P3/8
#  - [34, 68, 70, 50, 66, 130] # P4/16
#  - [120, 100, 160, 200, 370, 330] # P5/32
# #under is original rgbt6, rgbt18, rgbt20failed
#  - [10, 13, 16, 30, 33, 23] # P3/8
#  - [30, 61, 62, 45, 59, 119] # P4/16
#  - [116, 90, 156, 198, 373, 326] # P5/32
#rndgoo
#  - [27, 32, 33, 42, 37, 60]  # P3/8
#  - [60, 79, 45, 104, 71, 120]  # P4/16
#  - [115, 161, 130, 250, 280, 290]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3, [128]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]], # 5-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 15

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 19 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 15], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 22 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 25 (P5/32-large)

    [[19, 22, 25], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
